"""
============================
Author:柠檬班-木森
Time:2020/11/12  20:19
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
顺序：代码执行的顺序从上往下
分支：根据不同的条件，执行不同的代码
循环：特定的代码重复执行


分支（条件判断）：
语法：
    if  条件 ：
        # 条件成立执行的代码

------------------------------------------------------    
    if 条件:
        # 条件成立执行的代码
    else:
        # 条件不成立执行的代码
   
-------------------------------------------------- 
 
    if 条件一:
        # 条件成立执行的代码
    elif 条件二:
        # 条件二成立执行的代码
    elif 条件三:
        # 条件三成立执行的代码
    else:
        # 上面的条件都不成立执行的代码
 
 
    
:后面要换行缩进四个空格（tab键）再写代码


"""
#
# price = int(input("请输入考试分数："))
#
# if price >= 60:
#     print("很开心，你考试及格")
#     print("今天可看电视")
#     print("可以吃大餐")
# else:
#     print("不及格，获得一个大嘴巴子")
#     print("今天晚上通宵敲代码")
#

# -----------------------------------------------------
"""
###### 需求三：请根据用户输入成绩，按以下等级区分：

59<：D
60-75：C
76-85：B
86-100：A
"""
# price = int(input("请输入考试分数："))
# if 0 <= price <= 59:
#     print("等级为D")
# elif 60 <= price <= 75:
#     print("等级为C")
# elif 76 <= price <= 85:
#     print("等级为B")
# elif 86 <= price <= 100:
#     print("等级为A")
# else:
#     print("您输入的成绩有误！")
