"""
============================
Author:柠檬班-木森
Time:2020/11/5  20:10
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
字符串得格式化：

1、字符串拼接： + （可以通过+来连接字符串）



"""
# name = input("输入名字：")
# money = input("输入金额：")

# print("今收到", name, "交来学费", money, "元,开此收据为凭")

# 1、字符串拼接
# desc = "今收到" + name + ",交来学费" + money + "元,开此收据为凭"
# print(desc)

# 2、format：格式化
# 今收到XXX,交来学费XXX元,开此收据为凭
# name = input("输入名字：")
# money = input("输入金额：")
# desc = "今收到{},交来学费{}元,开此收据为凭"
# print(desc.format(name, money))
# desc2 = "今收到{},交来学费{}元,开此收据为凭".format('李四', 800)
# print(desc2)

# 3、传统的%号格式化（了解即可）
"""
%s :  表示一个字符串占位符（后面填任意类型的数据都可以）
%d :  表示一个整数占位符（后面只能填数值类型的数据,会转换为整数）  
%f :  表示一个浮点数占位（后面只能填数值类型的数据，为转换为小数）bool  int  float
"""
# name = input("输入名字：")
# money = input("输入金额：")
# desc = "今收到%s,交来学费%s元,开此收据为凭" % (name, money)
# print(desc)
# print('交来学费%d元' % (8.88))
# print('交来学费%f元' % (700))


# 4、字符串的f 表达式(f小写大写都可以)
# name = '张三'
# age = 800
# desc4 = F'收到{name},交来学费{age}元,开此收据为凭'
# print(desc4)
