"""
============================
Author:柠檬班-木森
Time:2020/11/5  20:10
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
python中所有的序列类型（字符串、列表、元组）数据都有索引

索引：
    正向索引：按从前往后的顺序，从0开始数，越往后值越大
    反向索引：按后前往前的顺序，从-1开始数，越往前值越小
    
索引取值：  结果 = 数据[索引值] 
    s1 = 'abcdefg'
    res = s1[4]

切片：
    1、切片：[start:end]
        结果 = 数据[起始位置索引:终止位置的索引]
        切片注意点：取头不取尾  （左闭右开）
    2、加步长的切片:[start:end:length]
        结果 = 数据[起始位置索引:终止位置的索引:步长]
    # 注意点：起始位置和终止位置不写，默认代表最前面和最后面


"""
# s1 = 'abcdefg'
# res = s1[-3]
# print(res)


# 需求: 从下面的字符串中获取python这个字符串片段
# s2 = 'java python php'
# res2 = s2[5:11]
# print(res2)


# 需求： 通过切片获取：147
s = '123456789'
#    123 456 7
# res3 = s[0:7:3]
# print(res3)
# 234 567 8
# print(s[1:8:3])

# 1234 5678 9
# print(s[::4])
