"""
============================
Author:柠檬班-木森
Time:2020/11/5  20:10
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
format:
1、可以在{}中指定填充数据的位置
    desc2 = "今收到{1},交来学费{0}元,开此收据为凭".format('李四', 800)
2、格式化小数位数
    desc2 = "今收到{},交来学费{:.3f}元,开此收据为凭".format('李四', 888.99499923232)
3、格式化百分比显示：
    desc3 = '接口自动的用例执行通过率为 {:.1%}'.format(0.8899)
4、格式化字符串的长度：
        {:^20}:  ^居中对齐
        {:<20}:  左对齐
        {:>20}:  右对齐
        {:*>20}:可以在对齐符号的前面指定填充字符
# """
# desc2 = "今收到{1},交来学费{0}元,开此收据为凭".format('李四', 800)
# print(desc2)

# desc2 = "今收到{},交来学费{:.3f}元,开此收据为凭".format('李四', 888.99499923232)
# print(desc2)

# desc3 = '接口自动的用例执行通过率为 {:.1%}'.format(0.8899)
# print(desc3)

print("今收到{:*^20},交来学费80元,开此收据为凭".format('dasda'))
print("今收到{:$>20},交来学费80元,开此收据为凭".format('dsiuauidas'))
print("今收到{:$>20},交来学费80元,开此收据为凭".format('ds'))
print("今收到{:*>20},交来学费80元,开此收据为凭".format('dsasdasdsasda'))
