"""
============================
Author:柠檬班-木森
Time:2020/11/4  16:57
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
# ------------------------------1------------------------------------------
"""
1、下面那些不能作为变量？
1、find     2、 _num    3、7val        4、add.       5、def     
6、pan      7、-print   8、open_file   9、FileName   10、print?  
11、INPUT   12、ls      13、user^name  14、list1     15、str_

答案：
    7val     add.       def    print? 
    -print   user^name 
     
"""

# ------------------------------2------------------------------------------
"""

2、写一段代码，运行的时候依次提示输入姓名，年龄、性别
然后在控制台 按照以下格式输出信息  ：姓名、年龄、性别 ：

答案：
"""
name = input("请输入姓名:")
age = input("请输入年龄:")
gender = input("请输入性别:")

print("*********************")
print("姓名:", name)
print("年龄:", age)
print("性别:", gender)
print("*********************")
"""

# ------------------------------3------------------------------------------
3、python中如何给代码添加注释
    单行注释：在要注释的代码前面加上： #空格 
    多行注释：使用三引号开头、三引号结尾 把要注释的内容给包起来 
"""

# ------------------------------4------------------------------------------
# 4、请定义一个字符串，并通过print打印字符串，打印出来字符串的内容如下
# PHP is the best"""programming"language in 'theorld

str4 = 'PHP is the best""" programming"language in \'theorld'
print(str4)
