"""
============================
Author:柠檬班-木森
Time:2020/11/3  21:17
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
五、数值类型的数据：
    整数：int（整数）
    小数: float（浮点数）
    布尔值:(bool)是一种特殊的数值类型
        True （表示真，条件成立）
        False（表示假，条件不成）
        
        所有的数据都可以在转换为布尔值(了解)：
            非零为True:数据值不为0，数据长度不为0，数据值不为空(None)，那么这个数据的布尔值就是True

数值类型的运算：
    1、算术运算符：
         加（+） 
         减（-）  
         乘（*）  
         除（/）  
         除法取整 //
         除法取余 %
         幂运算 **
    2、比较运算符：
        大于：>
        小于：<
        大于等于: >= 
        小于等于:<=
        不等于: !=
        等等于: ==


"""
# 整数：int类型
age = 18

# 小数：float类型
number01 = 999.999

# print(1 / 11)
# print(13 % 5)
# print(5**3)
# print(10 != 10)
