"""
============================
Author:柠檬班-木森
Time:2020/11/14  11:44
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
一、必做题：

1：简单题
    1、函数的定义有哪几种形式？
    2、函数参数的调用有哪几种形式？

2、封装一个可以打印任意比列正方形的函数

* * * 
* * * 
* * * 


3、完善如下的计算器函数的功能代码，
def func(a,b,method):
    参数a：数字  
    参数b：数字
    参数method：计算方法：可以传 '+','-','*','/'
    
# 调用示例：    
func(11,22,'+')   --> 打印 33(a+b的结果)
func(100,22,'-')  --> 打印 78(a-b的结果)
    


4、定义一个可以完成任意个数字相加的函数（支持关键字传参和位置传参），并打印相加结果。
要求:调用函数传入1个数字，则打印这个数字。                                      
        如：func(1) ---->   打印 1
    调用函数传入2个数字，返回值为2个数相加的结果。                            
        如：func(11,22) ---->   打印33
    调用函数传入3个数字，返回值为3个数相加的结果。                            
        如：func(11,22,33,) ----> 打印66
    调用函数传入n个数字，返回值为n个数相加的结果。                             
        如：func(1,2,3,4,5) ----> 打印 15


5、请定义一个函数func，要求使用下面的方式去调用而不报错！

li = [11,22,33]
dic = {"a":11,"b":22,"c":22,"d":44}

func(*li)
func(**dic)


6、整理笔记

"""

"""
第一题：简单题
    1、函数的定义有哪几种形式？
    答案：必需参数、默认参数、不定长参数  （此题不计分，出题的时候少写了参数两个字）
    2、函数参数的调用有哪几种形式？
    答案：通过位置传参(位置参数)、通过参数名指定传参(关键字参数)

"""


# 第二题：
def print_func(n):
    """
    打印正方形
    :param n:
    :return:
    """
    for i in range(n):
        for i in range(n):
            print("* ", end='')
        print()


print_func(5)


# 第三题：
def func3(a, b, method):
    """
    计算器
    :param a: 数值1
    :param b: 数值2
    :param method: 数值的运算方法
    :return:
    """
    if method == "+":
        print("a+b的结果：", a + b)
    elif method == "-":
        print("a-b的结果：", a - b)
    elif method == "*":
        print("a*b的结果：", a * b)
    elif method == "/":
        print("a/b的结果：", a / b)


func3(11, 22, '/')


# 第四题：
def func4(*args, **kwargs):
    s = 0
    for i in args:
        s += i
    for k in kwargs:
        s += kwargs[k]
    print(s)


func4(a=11)


# 第五题：
# 方式1、第四个参数设置为默认参数
def func(a, b, c, d=99):
    pass

# 方式2：使用不定长参数
# def func(*args, **kwargs):
#     pass
