"""
============================
Author:柠檬班-木森
Time:2020/11/26  20:21
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
特征：属性
行为：方法

类的方法和属性
一、属性：
    1、类属性：这类事物都具备这个属性，并且属性值是一样的（定位为类属性）
        （类属性是所有的对象共有的）
        类属性的定义：直接定义在类里面的变量
                   类名.属性名 = 属性值
                    
        
    2、对象（实例）属性：对象自己的特性（属性）
        实例属性的定义：对象.属性名 = 属性值
    
    
二、方法：定义在类里面的函数叫做方法


    
 
 
人类：
    特征：有智慧 ，直立行走  名字，年龄




方法中的第一个参数self待会讲

"""


class Cat:
    # 类属性
    leg = 4
    tail = 1
    eye = 2

    def func(self):
        print("这个是抓老鼠的功能")

    def skill01(self):
        print("这换个是爬树的功能")


# 通过猫类创建对象
coffee = Cat()
coffee.name = "加菲猫"
coffee.age = '18个月'

# 通过对象调用方法
coffee.func()






jingle = Cat()
jingle.name = "叮当猫"
coffee.age = '50个月'


# # ------------方法怎么使用----------------
# s = '1111'
# res = s.replace('1','2')
# print(res)