"""
============================
Author:柠檬班-木森
Time:2020/11/21  9:45
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
内置函数open：
    参数file:传一个文件名(路径)
    参数mode：文件打开的模式
        #------------操作文本文件------
        r:只读，如果文件不存在，则报错
        w:覆盖写入，如果文件不存在，则会自动创建一个
        a:追加写入，如果文件不存在，则会自动创建一个
        
        
        #-----------图片或者视频等等文件，读取或者写入----------------
        # 不需要加encoding参数指定编码了
        rb(二进制的模式打开):只读，如果文件不存在，则报错
        wb(二进制的模式打开):覆盖写入，如果文件不存在，则会自动创建一个
        ab(二进制的模式打开):追加写入，如果文件不存在，则会自动创建一个
        
        
        #-----------扩展的模式（可读可写）---------------
        用不到  不需要掌握
        r+:
        a+:
        w+:
        rb+
        ab+
        wb+:
        
        
    参数encoding:指定编码格式
"""

# 1、打开文件，返回文件的句柄
f = open(file='log.jpg', mode='rb')
res = f.read()

f2 = open(file='logo2.jpg',mode='wb')
f2.write(res)

# 3、关闭文件
f.close()
f2.close()