"""
============================
Author:柠檬班-木森
Time:2020/11/21  9:45
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
内置函数open：
    参数file:传一个文件名(路径)
    参数mode：文件打开的模式
        r:只读，如果文件不存在，则报错
        w:覆盖写入，如果文件不存在，则会自动创建一个
        a:追加写入，如果文件不存在，则会自动创建一个
    参数encoding:指定编码格式


操作文件的步骤：
1、打开文件：使用内置函数open

2、进行操作（写）
    write方法：写入内容
   
    
3、关闭文件
    close方法


"""

#-----------------------a模式操作文件-----------------------
# # 1、打开文件，返回文件的句柄
# f = open(file='biji02.txt', mode='a', encoding='utf-8')
#
# f.write("\n"+'python00111')
#
# # 3、关闭文件
# f.close()


#-----------------------w模式操作文件-----------------------
# # 1、打开文件，返回文件的句柄
# f = open(file='biji04.txt', mode='w', encoding='utf-8')
#
# f.write('35期大佬很多')
#
# # 3、关闭文件
# f.close()