"""
============================
Author:柠檬班-木森
Time:2020/11/14  10:05
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
for 循环指定循环多少次？
内置函数range():可以用来生成一个指定长度的序列
    1、range(n):默认生成一个 0到n-1的整数序列，
        对于这个整数序列，我们可以通过list()函数转化为列表类型的数据。
    2、range（n,m)：默认生成一个n到m-1的整数序列，
        对于这个整数序列，我们可以通过list()函数转化为列表类型的数据。
    3、range(n,m,k)：相当于其他函数里面的for循环。
        n 初始值  m 结束值 ， k 步长，会生成初始值为n,结束值为m-1,递减或者是递增的整数序列。

"""
# li = list(range(100))
# print(li)

# for i in range(100, 200, 5):
#     print("这是第{}遍hello python".format(i))

# 打印0-100之间的偶数
# for i in range(101):
#     if i % 2 == 0:
#         print(i)


