"""
============================
Author:柠檬班-木森
Time:2020/11/10  17:23
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
import random

"""
一、一家商场在降价促销，需要编写一个程序，输入购买商品的总价格，再打印出折扣和最终价格。
 要求如下：   
    如果购买总金额0-49元(包含0元和49元)之间，不打折
    如果购买总金额50-100元(包含50元和100元)之间，会给打九折， 
    如果购买总金额大于100元，会给打八折。
  

二、提示用户输入一个整数，判断这个数是否为3和5的公倍数（同时被3和5整除)
能整除则打印 :您输入的是3和5的公倍数,获得双十一100元抵用券
不能整除则打印：你与优惠券错过啦



三、编写一个程序，使用循环打印0-100（包括0和100）之间的偶数


四、实现文字版的剪刀石头布游戏（扩展题）：
    1、运行程序 提示用户输入要出的拳 ：石头（1）／剪刀（2）／布（3）/退出（4）
    2、电脑随机出拳
    3、比较胜负，显示 用户胜、负还是平局。
    运行如下图所示（提示：while循环加条件判断，做判断时建议先分析胜负的情况）
        赢：   1：2      1-2 = -1                  
              2：3      2-3 = -1 
              3：1      3-1 = 2 
        平局  用户 ==电脑
    
        输：
        
        #-------------------------------
        
            user_num-r_num==-1  or user_num-r_num==2
        if  用户是否赢 (user_num ==1 and r_num==2) or (user_num ==2 and r_num==3) or (user_num ==3 and r_num==1)： 
            输出用户赢了
        elif 是否平局：user_num==r_num:
            输出平局
        else：
            输入你输了
        
        
五、整理笔记       


"""
# ---------------------第一题：------------------------
money = float(input("请输入购买总金额："))
if 0 <= money <= 49:
    print("你的总金额为{}元，不打折".format(money))
elif 50 <= money <= 100:
    print("你的总金额为{}元，打9折,应支付{}元".format(money, money * 0.9))
elif 100 < money:
    print("你的总金额为{}元，打8折,应支付{}元".format(money, money * 0.8))

# --------------------------第二题：-----------------------
number = int(input("请输入一个数字："))
if number % 3 == 0 and number % 5 == 0:
    print("您输入的是3和5的公倍数,获得双十一100元抵用券")
else:
    print("你与优惠券错过啦！")

# --------------------------第三题：-----------------------
i = 0
while i <= 100:
    if i % 2 == 0:
        print(i)
    i += 1

# --------------------------第四题：-----------------------
print('---石头剪刀布游戏开始----')
print('请按下面提示出拳：')
li = ["石头", '剪刀', '布']
dic = {1: "石头", 2: "剪刀", 3: "布"}
while True:
    print('石头【1】 剪刀【2】 布【3】 结束游戏【4】')
    # 用户输入数字
    user_num = int(input('请输入你的选项：'))
    # 电脑随机生成数字
    r_num = random.randint(1, 3)
    if 1 <= user_num <= 3:
        # 在这里判断游戏的胜负
        # pass：表示通过，没想好写什么代码之前可以用来占位
        if (user_num - r_num == -1) or (user_num - r_num == 2):
            print("你的出拳是{},电脑出拳：{}，您赢了".format(dic[user_num], dic[r_num]))
        elif user_num == r_num:
            print("你的出拳是{},电脑出拳：{}，平局".format(li[user_num - 1], li[r_num - 1]))
        else:
            print("你的出拳是{},电脑出拳：{}，您输了".format(li[user_num - 1], li[r_num - 1]))
    elif user_num == 4:
        # 用户输入4，游戏结束
        print('游戏结束')
        break
    else:
        print('您出拳有误，请按规矩出拳')
