"""
============================
Author:柠檬班-木森
Time:2020/11/7  9:43
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
列表的复制
copy:可以用来复制列表
sort：对列表进行排序
    升序（从小到大）:li2.sort()
    降序（从大到小）:li2.sort(reverse=True)
    
reverse:列表反转（反序）将列表倒过来
    


内置id：查看数据的内存地址编号

"""
# -------------copy:复制列表-------------
# li = [11, 22, 33]
# li2 = li.copy()
# li3 = li
# print('li:', li2)
# print('li2:', li)
# print('li3:', li3)
# print('li的id:', id(li))
# print('li2的id:', id(li2))
# print('li3的id:', id(li3))

#  ---------------sort：列表排序----------------------
# li2 = [11, 22, 33, 42, 121, 4, 121, 44, 21, 2323, 1212, 44, 45, 656, 232]
# # 升序（从小到大）
# li2.sort()
# print(li2)

# 降序（从大到小）
# li2 = [11, 22, 33, 42, 121, 4, 121, 44, 21, 2323, 1212, 44, 45, 656, 232]
# li2.sort(reverse=True)
# print(li2)

# ------------ reverse:列表倒序------------
# li3 = [11, 33, 'aa', 55, 99]
# li3.reverse()
# print(li3)

"""
[11, 33, 'aa', 55, 99],请将这个列表反序
# 通过切片将列表反序：
"""
# -------------扩展--------
li2 = [11, 33, 'aa', 55, 99]
res = li2[::-1]
print(res)
