"""
============================
Author:柠檬班-木森
Time:2020/11/7  11:08
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
    
"""
# ------列表转换为字符串---------
# li = [11,22,33,44]
# s = str(li)
# print(s,type(s))  #  '[11,22,33,44]'

#
s = '[11,22,33,44]'
s2 = '(11,22,33,44)'
# 需求把上述的字符串转成一个列表
# li = list(s)  # 行不通
# print(li)


# 内置函数eval:识别字符串中的有效python表达式（去掉字符串两边的引号）
li2 = eval(s2)
print(li2, type(li2))



#  --------------pyton中定义元祖的快捷方式（扩展，不推荐使用）---------------
tu = 11, 22, 33
print(tu, type(tu))


s3 = '[11,22,33,44],(11,22,33,44)'
res3= eval(s3)
print(res3,type(res3))
