"""
============================
Author:柠檬班-木森
Time:2020/11/7  11:08
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
字符串、列表、元组 统称：序列类型
序列的共同特征：
    1、都有索引值，内部元素是有序的。
    2、支持切片操作
    

都可以通过len()去获取元素的个数。


数据类型的相互转换：
数值：
    整数：int
    浮点数：float
    布尔值：bool
序列：
    字符串：str
    列表：list
    元组：tuple
    
"""
# --------------------int和float转换为str------------------
# n1 = 99
# n2 = 88.88
# print(type(n1), type(n2))
#
# n3 = str(n1)
# n4 = str(n2)
# print(type(n3), type(n3))

# ---------------str转换为int和float--------------------------
# s1 = '88'
# s2 = '99.99'
# s3 = int(s1)
# s4 = float(s2)
# print(s3, type(s3), s4, type(s4))


# -----------------列表和元祖之间的转换----------------
# 元组转列表
# tu = ('musen', 18, 'nan')
# li = list(tu)
# print(li,type(li))
#
#
# # 列表转元组
# li2 = ['musen', 18, 'nan']
# tu2 = tuple(li2)
# print(tu2,type(tu2))


