"""
============================
Author:柠檬班-木森
Time:2020/11/7  9:43
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
列表的增删查改：

添加数据:
    append：往列表的结尾处添加一个元素
    insert:往列表中指定索引位置插入元素
    extend：一次性往列表尾部添加多个元素
删除数据：
    remove:指定元素进行删除(如果存在多个，则只会删除第一个)
    pop:指定索引进行删除(默认删除的是最后一个)
    clear: 清空列表中的所有元素（调用完会返回删除的数据）

修改列表中元素的值：
    通过索引指定位置进行修改
    
查找元素：
    1、索引取值
    2、index:查找元素对应的索引（元素不存在，代码会报错）
    3、count：统计某个元素的个数


"""
# -------------------添加数据------------------------
# append
# li = [11, 22, 33, 44]
# li.append(99)
# li.append(999)
# print(li)

# insert:
# li = [11, 22, 33, 44]
# li.insert(4, 'musen')
# print(li)

# extend
# li = [11, 22, 33, 44]
# li.extend([888, 999, 777])
# li.extend('abc') #  扩展了解，实际不会使用到
# print(li)

# --------------------删除数据-------------------------

# 方法一： remove:
# li = [11, 22, 33, 44, 55, 66, 77, 88, 99,11,22,33,11,22]
# li.remove(11)
# print(li)


# 方法二：pop  :pop方法调用的时候，会返回删除的数据
# li = [11, 22, 33, 44, 55, 66, 77, 88, 99,11,22,33,11,22]
# res = li.pop(0)
# print(res)
# print(li)

# 方法三：clear:
# li = [11, 22, 33, 44, 55, 66, 77, 88, 99,11,22,33,11,22]
# li.clear()
# print(li)


#  -----------------------修改-----------------------
# li = [11, 22, 33, 44, 55]
# li[2] = 333
# print(li)


# -----------------------查找-----------------------
# li = [11, 22, 33, 44, 55,11,22,11,11,11]
# 方式1：索引取值
# res = li[3]
# print(res)

# index:查找元素对应的索引
# res = li.index(22)
# print(res)

# count：统计某个元素的个数
# res = li.count(55)
# print(res)




# -------字符串中的index和find----
# res2 = "sqwrrs".index('w')
# print(res2)
# res3 = "sqwrrs".find('g')
# print(res3)

