"""
============================
Author:柠檬班-木森
Time:2020/11/10  20:18
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
数值：int  float   bool
序列：str  list  tuple （有序的，有索引）

dict，set（没有下标索引）

字典：
定义： 字典是通过｛｝来表示的，每一条数据都是一个键值对（key:value），每个元素之间使用逗号隔开

字典的键在同一个字典中是唯一的（不能重复）

字典中的键：只能是不可变类型的数据,一般情况下都是使用字符串来作为字典的键
    不可变类型的数据：数值(int,float,bool)，字符串、元组
    可变类型的：列表、字典、集合（有增删查改的方法）

"""
# 在列表和元组中获取指定的数据只能通过下标索引进行获取
# li = ["木森", 18, '男']
# li2 = [18, '男', "木森"]
# print(li2[0])


# 定义一个字典
dic = {"age": 18, "gender": "男","name": "木森"}
res = dic["name"]
# print(res)

# 注意点：字典的键在同一个字典中是唯一的（不能重复）
# dic = {"a":100,"a":999,"a":9999}
# print(dic)   # 打印结果 ===》{'a': 9999}