"""
============================
Author:柠檬班-木森
Time:2020/11/10  20:18
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
集合（set）：
    1、集合定义：也是使用{}来定义，
        注意点：{}代表空字典，空集合使用set()来定义

    2、集合是可变类型的数据(有增删查改的方法)
    
    3、集合中的元素是唯一的（没有重复的元素）
        应用场景：数据去重

    4、集合中的元素是无序的（没有下标索引）

    5、集合中只能存放不可变类型的数据

"""

# set1 = {11, 22, 33, 44}
# print(type(set1))


# 空字典还是空集合？？
# set2 = {}
# print(type(set2))
# 空集合：
# set3 = set()
# print(type(set3))


# 集合种事没有重复的元素的
# set4 = {1, 2, 3, 1, 2, 3, 1, 3, 4, 1, 2, 3, 1, 2}
# print(set4)

# 无序
# li = ["101", '101', '102', '101', '103']
# res = set(li)
# print(res)

# 集合中只能存放不可变类型的数据
s = {1, 1.1, False, 'str11', (11, 22, 33)}
