"""
============================
Author:柠檬班-木森
Time:2020/11/7  13:31
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
一、现在有一个列表 li2=[1，2，3，4，5]，
     第一步：对上面的列表进行添加和修改操作，将列表改成这个样子 li2 = [0，1，2，3，66，5，11，22，33]，
     第二步：对列表进行升序排序 （从小到大）
     第三步：将列表复制一份进行降序排序（从大到小）
     
二、定义一个空列表user=[],   分别提示用户输入，姓名，年龄，身高，用户输入完之后，
    要求1：在控制台输出如下内容：用户的姓名为：xxx,年龄为：xxx,  身高为：xxx  ,请仔细核对
    要求2：将输入的信息添加到列表中保存，打印列表到控制台：
    
三、 将字符串中的单词位置反转，“hello xiao mi” 转换为 “mi xiao hello”
（提示：可以通过字符串分割，列表反序，字符串拼接等操作来实现）


四、列表和元组的切片练习：
    1、li = [1,2,3,4,5,6,7,8,9] 请通过切片得出结果 [3,6,9]
    2、tu = ('java','c++','python','c','php','c#'),请通过切片获取（'java','php'）

五、（选做题，不计分）编写代码，提示用户输入1-7中的数字,(分别代表 周一 到 周日)
    打印输出“今天是周X”
    提示：这道题可以通过学过的知识点去实现，
    有时间的同学也可以尝试去扩展python中的条件判断,通过条件判断来实现

六、整理笔记
    
"""
print("--------------------第一题-----------------------")
li2 = [1, 2, 3, 4, 5]
# 第一步：
li2[3] = 66
li2.insert(0, 0)
li2.extend([11, 22, 33])
print(li2)
# 第二步：
li2.sort()
print(li2)
# 第三步：
li3 = li2.copy()
li3.sort(reverse=True)
print(li3)

print("--------------------第二题-----------------------")
user = []
name = input("请输入姓名：")
age = input("请输入年龄：")
height = input("请输入身高：")
print('用户的姓名为：{},年龄为：{},  身高为：{}  ,请仔细核对'.format(name, age, height))
user.extend([name, age, height])
print(user)

print("----------------------第三题------------------------")
str1 = 'hello xiao mi'
data = str1.split(' ') # ['hello','xiao' ,'mi']
print(data)
data.reverse()
res = ' '.join(data)
print(res)

print("----------------------第四题------------------------")
li = [1, 2, 3, 4, 5, 6, 7, 8, 9]
print(li[2::3])
tu = ('java', 'c++', 'python', 'c', 'php', 'c#')
print(tu[::4])

print("----------------------第五题------------------------")
datas = ["周一", "周二", "周三", "周四", '周五', "周六", "周日"]

num = int(input("请输入1-7中的一个数字：")) - 1
desc = "今天是{}".format(datas[num])
print(desc)