"""
============================
Author:柠檬班-木森
Time:2020/11/17  20:18
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
一、调用函数的时候参数传递的方式：
    1、位置传参（位置参数）
        例：add(101, 22)
    2、指定参数名传参（关键字参数）
        add(m=101, n=22)
    3、注意点：两种传参方式混合使用的时候，位置参数在前，关键字参数在后




"""


# def add(n, m):
#     print("n：", n)
#     print("m:", m)
#     print(n + m)


# 位置参数
# add(101, 22)
# 关键字参数
# add(m=101, n=22)

# -----------------------------------
# def add(n, m, a, b):
#     print("n：", n)
#     print("m:", m)
#     print("a：", a)
#     print("b:", b)


# add(a=11, b=22, n=33, m=44)
# 两种传参方式混合使用的时候，位置参数在前，关键字参数在后
# add(11, 22, a=33, b=44)
# add(11, 22, b=33, a=22)
