"""
============================
Author:柠檬班-木森
Time:2020/11/17  20:18
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""
函数定义的形式：
    1、必备参数(必需参数)：定义了必须要传，不能多不能少
        def func(a,b):
    
    2、默认参数(缺省参数)：调研的时候可以传，也可以不传，不传就使用默认值
       def func(a=11,b=22): 
    
    3、不定长参数(可变参数)：调用的时候可以传0个或者多个值
        *args: 只能使用位置传参的形式传值，接收到的参数以元组的形式保存
        **kwargs: 只能使用关键字参数的形式传值，接收到的参数以字典的形式保存


注意点：必需参数要写前面，默认参数写后面
"""


# 1、-------必备参数-------
# def add(n, m, c):
#     print("n：", n)
#     print("m:", m)
#     print("c:", c)
# add(11, 22, 66)


# 2、---------默认参数----------
# def add(n=11, m=22, c=99):
#     print("n：", n)
#     print("m:", m)
#     print("c:", c)
# add(c=99999)


# 3、-------------不定长参数---------------
# def func(*args):
#     print(args)
# func()
# func(11, 22, '33', 333, 444, 111, 333, 444, 433, 432, 22)

# def func(**kwargs):
#     print(kwargs)

# func()
# func(aa=11, b=22, c=22, dd=444, g=555)

# print("a", "b", "c", "ccc", 100, 220, 333, 322, 11, 22, 3333, 444, 55, 666, 77, 88)


#  需求：定义一个可以接收任意个参数的函数，同时支持位置传参和关键字传参

# def func(*args, **kwargs):
#     print(args)
#     print(kwargs)
#
#
# func(11, 22)
# func(11, 22, a=33, b=44)
# func(bb=11, c=22, a=33, b=44)


def func(a, b, c=99, *args, **kwargs):
    print(a)
    print(b)
    print(c)
    print(args)
    print(kwargs)


func(11, 22, 33, 111, 22, 222, aa=22)
