"""
============================
Author:柠檬班-木森
Time:2020/11/17  20:18
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""
"""


1、函数的参数可以传任意类型

2、函数中养成写注释的习惯

3、函数参数的拆包（仅限于函数调用是传参使用）
 * 可以对列表或者元组进行拆包，把元素当成位置参数传递
 ** 可以对字典进行拆包处理，把元素当成关键字参数传递

"""
import requests


def func(a, b, c=99):
    """
    函数功能说明的注释
    :param a:
    :param b:
    :param c:
    :return:
    """
    print(a)
    print(b)
    print(c)


li = [11, 22, 33, 44]

# func(li[0],li[1],li[2])

# func(*li)  # 调用函数的时候可以使用*对列表或者元组进行拆包，把元素当成位置参数传递


dic = {"a": 111, "b": 222, "c": 333}  # 调用函数的时候可以使用**对字典进行拆包,把元素当成关键字参数传递
func(**dic)
