"""
============================
Author:柠檬班-木森
Time:2020/11/14  11:44
E-mail:3247119728@qq.com
Company:湖南零檬信息技术有限公司
============================
"""

"""
1、(字典遍历）当前有一个字典｛"a":1,"b":22,"c":3,"d":4,"e":5 },
    请修改字典中所有键值对的值，新的值为原来的值乘10

2、(列表推导式)，请生成一个如下的列表：["data5","data10","data15",..."data95"]


3、运行程序，提示用户依次输入三个整数x,y,z，请把这三个数由小到大输出。


4、通过代码打印如下99乘法口诀表
1*1=1   
1*2=2   2*2=4   
1*3=3   2*3=6   3*3=9   
1*4=4   2*4=8   3*4=12  4*4=16  
1*5=5   2*5=10  3*5=15  4*5=20  5*5=25  
1*6=6   2*6=12  3*6=18  4*6=24  5*6=30  6*6=36  
1*7=7   2*7=14  3*7=21  4*7=28  5*7=35  6*7=42  7*7=49  
1*8=8   2*8=16  3*8=24  4*8=32  5*8=40  6*8=48  7*8=56  8*8=64  
1*9=9   2*9=18  3*9=27  4*9=36  5*9=45  6*9=54  7*9=63  8*9=72  9*9=81 

5、（扩展题）1、有1 2 3 4 这四个数字，请求通过代码计算能组成多少个互不相同且无重复数字的3位数？分别是什么？
（思路提示：其实就是数学排列组合，C4取3，三层for循环嵌套可以实现）

 a ->个   1，2，3，4
 b ->十   1，2，3，4
 c ->百   1，2，3，4 

    if a!=b and b!=c and c!=a: 

"""
print("----------------第一题------------------")
dic = {"a": 1, "b": 22, "c": 3, "d": 4, "e": 5}
for i in dic:
    dic[i] = dic[i] * 10

print(dic)

print("----------------第二题------------------")
li = ["data{}".format(i) for i in range(5, 100, 5)]
print(li)

print("----------------第三题------------------")
x = int(input('输入数字x：'))
y = int(input('输入数字y：'))
z = int(input('输入数字z：'))
num_list = [x, y, z]
# 从小到大排序
num_list.sort()
# 遍历输出
for num in num_list:
    print(num)

print("----------------第四题------------------")
for i in range(1, 10):  # 1,2,3,4,5,6,7,8,9
    for j in range(1, i + 1):  # i
        print("{}*{}={:<4}".format(j, i, i * j), end="")

    print()

print("--------------第五题：扩展题-------------")

li = [1, 2, 3, 4]
count = 0
for a in li:
    for b in li:
        for c in li:
            # print("{}{}{}".format(a, b, c))
            if a != b and a != c and b != c:
                # print("{}{}{}".format(a,b,c))
                count += 1

print("一个有{}个".format(count))
